Tekla Open API Reference for Tekla Structures 2025
DrawingEnumerator.Current Property
 Gets the current drawing.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Drawing Current { get; }
Public ReadOnly Property Current As Drawing
	Get
Property Value
Type: Drawing
See Also
Reference
DrawingEnumerator Class
Tekla.Structures.Drawing Namespace